#include "guineapigPrint.h"

guineapigPrint::guineapigPrint()
{
}

guineapigPrint::~guineapigPrint()
{
}

void guineapigPrint::rate_init(){// 값 체크 함수 
	if (health>9){
		health = 9;
	}
	if (toilet<0){
		toilet = 0;
	}
	else if (toilet>9) toilet = 9;
	if (hungry<0){
		hungry = 0;
	}
	else if (hungry>9) hungry = 9;
	if (sleep<0)
	{
		sleep = 0;
	}
	else if (sleep>9) sleep = 9;
	if (funny>9){
		funny = 9;
	}
	else if (funny<0) funny = 0;
	////////// 병걸렸는지확인

	if (health <= 0)
	{
		health = 0;
		gotoxy(13, 13);
		cout << "┏━━━━━━━━━━━┓";
		gotoxy(13, 14);
		cout << "┃다마고치가병에걸렸어요┃";
		gotoxy(13, 15);
		cout << "┗━━━━━━━━━━━┛";
		Sleep(1000);
	}
	///////////사망값체크
	if (hungry >= 9)
	{
		if (toilet >= 9 || sleep >= 9)
		{
			this->death();
		}
	}
	//지능 9일때 특권
	if (intel == 9)
	{
		if (toilet>8)
		{
			gotoxy(5, 11);
			cout << "┏━━━━━━━━━━━━━━━━━━┓";
			gotoxy(5, 12);
			cout << "┃다마고치가 스스로 용변을 해결햇어요.┃";
			gotoxy(5, 13);
			cout << "┗━━━━━━━━━━━━━━━━━━┛";
			Sleep(1000);
			toilet = 0;
			intel = 0;
		}
		if (health<2)
		{
			gotoxy(5, 11);
			cout << "┏━━━━━━━━━━━━━━━━━━┓";
			gotoxy(5, 12);
			cout << "┃다마고치가 스스로 병원에 다녀왔어요.┃";
			gotoxy(5, 13);
			cout << "┗━━━━━━━━━━━━━━━━━━┛";
			Sleep(1000);
			health = 9;
			intel = 0;
		}
		if (hungry>8)
		{
			gotoxy(5, 11);
			cout << "┏━━━━━━━━━━━━━━━━━━┓";
			gotoxy(5, 12);
			cout << "┃다마고치가 스스로 밥을 해먹었어요...┃";
			gotoxy(5, 13);
			cout << "┗━━━━━━━━━━━━━━━━━━┛";
			Sleep(1000);
			hungry = 0;
			intel = 0;
		}
	}


	///////////
	srand(time_t(NULL));
	string stat[5];
	if (funny>5){ stat[0] = "기분이 좋아요!"; }
	if (funny<5){ stat[0] = "심심하고 무료하네요.."; }
	if (hungry>5){ stat[1] = "배가 고파요.."; }
	if (hungry<5){ stat[1] = "배 부르당!"; }
	if (sleep>5){ stat[2] = "졸려요..자장가불러주세요.."; }
	if (sleep<5){ stat[2] = "좋아 좋아 좋아.."; }
	if (toilet>5){ stat[3] = "아아.....쌀것같아..."; }
	if (toilet<5){ stat[3] = "힝 .. 힝 뭘봐 !"; }
	if (health<5){ stat[4] = "몸이 왠지 무겁네요...."; }
	if (health>5){ stat[4] = "오오 좋아 힘이 넘쳐!"; }
	this->stat = stat[rand() % 5]; // 랜덤으로 상태 저장 
	//////////////// 행복도 검사
	if (funny == 9)
	{
		for (int i = 0; i<3; i++){
			gotoxy(13, 13);
			cout << "┏━━━━━━━━━━┓";
			gotoxy(13, 14);
			cout << "┃진화 하였습니다!!!!!┃";
			gotoxy(13, 15);
			cout << "┗━━━━━━━━━━┛";
			Sleep(1000);
			gotoxy(13, 13);
			cout << "┏━━━━━━━━━━┓";
			gotoxy(13, 14);
			cout << "┃                    ┃";
			gotoxy(13, 15);
			cout << "┗━━━━━━━━━━┛\n";
			Sleep(500);
		}
		age += 1;
		funny = 0;

	}
}

void guineapigPrint::actoilet()
{
	if (health>0){
		if (toilet>0){
			system("cls");
			cout << "┏━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃  -=MENU=-  ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□■■■■■■□□□□□□□□□□□┃┃1. 상태확인 ┃\n";
			cout << "┃□■□□□□□□■□□□□□□□□□□┃┃2. 식사     ┃\n";
			cout << "┃□■□■□□■□■□□□□□□□□□□┃┃3. 화장실   ┃\n";
			cout << "┃□■□□□□□□■□□□□□□□□□□┃┃4. 취침     ┃\n";
			cout << "┃■■■□■■□□■■□□□□□□□□□┃┃5. 병원     ┃\n";
			cout << "┃□■□□□□□□■□□□■□□□□□■┃┃-. 저장  후 ┃\n";
			cout << "┃□■□□□□□□■□□■□□□■□■□┃┃   게임종료 ┃\n";
			cout << "┃□□■□■■■□■□□□■□□■■□□┃┃            ┃\n";
			cout << "┃□□■□■□■□■□□□□■■■■■□┃┃            ┃\n";
			cout << "┃□□□■□□□■□□□□■■■■■■■┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□■■■■■■■┃┃            ┃\n";
			cout << "┗━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
			Sleep(700);
			gotoxy(1, 1);
			cout << "┏━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃  -=MENU=-  ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□■■■■■■□□□□□□□□□□□┃┃1. 상태확인 ┃\n";
			cout << "┃□■□□□□□□■□□□□□□□□□□┃┃2. 식사     ┃\n";
			cout << "┃□■□■□□■□■□□□□□□□□□□┃┃3. 화장실   ┃\n";
			cout << "┃□■□□□□□□■□□□□□□□□□□┃┃4. 취침     ┃\n";
			cout << "┃■■■□■■□□■■□□□□□□□□□┃┃5. 병원     ┃\n";
			cout << "┃□■□□□□□□■□□□□□□□□□□┃┃-. 저장  후 ┃\n";
			cout << "┃□■□□□□□□■□□□□□□□□□□┃┃   게임종료 ┃\n";
			cout << "┃□□■□■■■□■□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□■□■□■□■□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□■□□□■□□□□■■■■■■■┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□■■■■■■■┃┃            ┃\n";
			cout << "┗━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
			Sleep(700);
			gotoxy(1, 1);
			cout << "┏━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃  -=MENU=-  ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□■■■■■■□□□□□□□□□□□┃┃1. 상태확인 ┃\n";
			cout << "┃□■□□□□□□■□□□□□□□□□□┃┃2. 식사     ┃\n";
			cout << "┃□■□■□□■□■□□□□□□□□□□┃┃3. 화장실   ┃\n";
			cout << "┃□■□□□□□□■□□□□□□□□□□┃┃4. 취침     ┃\n";
			cout << "┃■■■□■■□□■■□□□□□□□□□┃┃5. 병원     ┃\n";
			cout << "┃□■□□□□□□■□□□□□□□□□□┃┃-. 저장  후 ┃\n";
			cout << "┃□■□□□□□□■□□□□□□□□□□┃┃   게임종료 ┃\n";
			cout << "┃□□■□■■■□■□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□■□■□■□■□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□■□□□■□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┗━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
			Sleep(700);
			gotoxy(1, 1);
			cout << "┏━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
			cout << "┃□□□□□□□□□□■■■□□□□□□┃┃  -=MENU=-  ┃\n";
			cout << "┃□□□□□□□□□□■□■□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□■■■□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□■□■■■□□┃┃            ┃\n";
			cout << "┃□□■■■■■■□□■■■□■□■□□┃┃1. 상태확인 ┃\n";
			cout << "┃□■□□□□□□■□□□□□■■■□□┃┃2. 식사     ┃\n";
			cout << "┃□■□■□□■□■□□■■■□□□□□┃┃3. 화장실   ┃\n";
			cout << "┃□■□□□□□□■□□■□■□□□□□┃┃4. 취침     ┃\n";
			cout << "┃■■■□■■□□■■□■■■□□■□□┃┃5. 병원     ┃\n";
			cout << "┃□■□□□□□□■□□□□□■■■□□┃┃-. 저장  후 ┃\n";
			cout << "┃□■□□□□□□■□□□□□■□■□□┃┃   게임종료 ┃\n";
			cout << "┃□□■□■■■□■□□□□□■■■□□┃┃            ┃\n";
			cout << "┃□□■□■□■□■□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□■□□□■□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┗━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
			Sleep(700);

			system("cls");
			sleep += 1;
			toilet = 0;
			funny += 1;
			health -= 1;

			cout << "\n 용변을 처리 했습니다!! 캬~ 시원하다잉~! \n\n 용변이 0이 되었습니다.\n\n ";
			system("pause");
		}
		else{
			gotoxy(13, 13);
			cout << "┏━━━━━━━━━━┓";
			gotoxy(13, 14);
			cout << "┃별로 가고 싶지않아요┃";
			gotoxy(13, 15);
			cout << "┗━━━━━━━━━━┛";
			Sleep(1000);
		}
	}
	else{
		gotoxy(13, 13);
		cout << "┏━━━━━━━━━━┓";
		gotoxy(13, 14);
		cout << "┃아파서 못움직여요.. ┃";
		gotoxy(13, 15);
		cout << "┗━━━━━━━━━━┛";
		Sleep(1000);
	}


}
void guineapigPrint::acsleep()
{
	srand(time_t(NULL));
	if (health>0){
		if (sleep>0)
		{
			system("cls");
			for (int i = 0; i<3; i++){
				cout << "┏━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
				cout << "┃□□□□□□□□□□□□□□□□□□□┃┃  -=MENU=-  ┃\n";
				cout << "┃□□□□□□□■■□□□□□□□□□□┃┃            ┃\n";
				cout << "┃□□□□□■■■■■■□□□□□□□□┃┃            ┃\n";
				cout << "┃□□□□■□□□□□□■□□■■■□□┃┃            ┃\n";
				cout << "┃□□□□■□■■■■□■□□□□■□□┃┃1. 상태확인 ┃\n";
				cout << "┃□□□□■□□□□□□■□□□■□□□┃┃2. 식사     ┃\n";
				cout << "┃□□□□□■□□□□■□□□■■■□□┃┃3. 화장실   ┃\n";
				cout << "┃□□□□■■■■■■■■□□□□□□□┃┃4. 취침     ┃\n";
				cout << "┃□□□■□□□□□□□□■□□□□□□┃┃5. 병원     ┃\n";
				cout << "┃□□□■□■□■□■□■■□□□□□□┃┃-. 저장  후 ┃\n";
				cout << "┃□□□■□□■□■□■□■□□□□□□┃┃   게임종료 ┃\n";
				cout << "┃□□□■□□■□■□■□■□□□□□□┃┃            ┃\n";
				cout << "┃□□□■□■□■□■□■■□□□□□□┃┃            ┃\n";
				cout << "┃□□□□■■■■■■■■□□□□□□□┃┃            ┃\n";
				cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
				cout << "┗━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
				Sleep(700);
				gotoxy(1, 1);
				cout << "┏━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
				cout << "┃□□□□□□□□□□□□□□□□□□□┃┃  -=MENU=-  ┃\n";
				cout << "┃□□□□□□□■■□□□□□□□■■■┃┃            ┃\n";
				cout << "┃□□□□□■■■■■■□□□□□□□■┃┃            ┃\n";
				cout << "┃□□□□■□□□□□□■□□□□□■□┃┃            ┃\n";
				cout << "┃□□□□■□■■■■□■□□□□■■■┃┃1. 상태확인 ┃\n";
				cout << "┃□□□□■□□□□□□■□□□□□□□┃┃2. 식사     ┃\n";
				cout << "┃□□□□□■□□□□■□□□□□□□□┃┃3. 화장실   ┃\n";
				cout << "┃□□□□■■■■■■■■□□□□□□□┃┃4. 취침     ┃\n";
				cout << "┃□□□■□□□□□□□□■□□□□□□┃┃5. 병원     ┃\n";
				cout << "┃□□□■□■□■□■□■■□□□□□□┃┃-. 저장  후 ┃\n";
				cout << "┃□□□■□□■□■□■□■□□□□□□┃┃   게임종료 ┃\n";
				cout << "┃□□□■□□■□■□■□■□□□□□□┃┃            ┃\n";
				cout << "┃□□□■□■□■□■□■■□□□□□□┃┃            ┃\n";
				cout << "┃□□□□■■■■■■■■□□□□□□□┃┃            ┃\n";
				cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
				cout << "┗━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
				Sleep(700);
				gotoxy(1, 1);
			}
			hungry += 1;
			sleep -= 3;
			toilet += 1;
			funny += rand() % 2;
			health += 2;

		}
		else{
			gotoxy(13, 13);
			cout << "┏━━━━━━━━━━┓";
			gotoxy(13, 14);
			cout << "┃잠이 오지 않아요....┃";
			gotoxy(13, 15);
			cout << "┗━━━━━━━━━━┛";
			Sleep(1000);
			system("cls");
		}
	}
	else{
		gotoxy(13, 13);
		cout << "┏━━━━━━━━━━━┓";
		gotoxy(13, 14);
		cout << "┃다마고치가병에걸렸어요┃";
		gotoxy(13, 15);
		cout << "┗━━━━━━━━━━━┛";
		Sleep(1000);
	}
}

void guineapigPrint::hospital()
{
	if (health == 0){
		system("cls");
		for (int i = 0; i<3; i++){
			cout << "┏━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃  -=MENU=-  ┃\n";
			cout << "┃□□□□□□□□□□□■□□□□□■□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□■□■□■□□┃┃            ┃\n";
			cout << "┃□□■■■■■■□□□□□□■□□□□┃┃            ┃\n";
			cout << "┃□■□□□□□□■□□□□□■□□□□┃┃1. 상태확인 ┃\n";
			cout << "┃□■□■■■■□■□□□□■■■□□□┃┃2. 식사     ┃\n";
			cout << "┃□■□□□□□□■□□□□■■■□□□┃┃3. 화장실   ┃\n";
			cout << "┃■■□□■■□□■■□□□■□■□□□┃┃4. 취침     ┃\n";
			cout << "┃□■□■□□■□■□□□□■□■□□□┃┃5. 병원     ┃\n";
			cout << "┃□■□□□□□□■□□□□■□■□□□┃┃-. 저장  후 ┃\n";
			cout << "┃□□■□■■■□■□□■■■□■■■□┃┃   게임종료 ┃\n";
			cout << "┃□□■□■□■□■□□□■■■■■□□┃┃            ┃\n";
			cout << "┃□□□■□□□■□□□□□□■□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□■■■□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┗━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
			Sleep(700);
			gotoxy(1, 1);
			cout << "┏━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃  -=MENU=-  ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□■□□□□┃┃            ┃\n";
			cout << "┃□□■■■■■■□□□□□□■□□□□┃┃            ┃\n";
			cout << "┃□■□□□□□□■□□□□□■□□□□┃┃1. 상태확인 ┃\n";
			cout << "┃□■□■■■■□■□□□□■■■□□□┃┃2. 식사     ┃\n";
			cout << "┃□■□□□□□□■□□□□■■■□□□┃┃3. 화장실   ┃\n";
			cout << "┃■■□□■■□□■■□□□■□■□□□┃┃4. 취침     ┃\n";
			cout << "┃□■□■□□■□■□□□□■□■□□□┃┃5. 병원     ┃\n";
			cout << "┃□■□□□□□□■□□□□■□■□□□┃┃-. 저장  후 ┃\n";
			cout << "┃□□■□■■■□■□□■■■□■■■□┃┃   게임종료 ┃\n";
			cout << "┃□□■□■□■□■□□□■■■■■□□┃┃            ┃\n";
			cout << "┃□□□■□□□■□□□□□□■□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□■■■□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┗━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
			Sleep(700);
			gotoxy(1, 1);
			cout << "┏━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃  -=MENU=-  ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□■□■□■□□┃┃            ┃\n";
			cout << "┃□□■■■■■■□□□□□□■□□□□┃┃            ┃\n";
			cout << "┃□■□□□□□□■□□□□□■□□□□┃┃1. 상태확인 ┃\n";
			cout << "┃□■□■■■■□■□□□□■■■□□□┃┃2. 식사     ┃\n";
			cout << "┃□■□□□□□□■□□□□■■■□□□┃┃3. 화장실   ┃\n";
			cout << "┃■■□□■■□□■■□□□■□■□□□┃┃4. 취침     ┃\n";
			cout << "┃□■□■□□■□■□□□□■□■□□□┃┃5. 병원     ┃\n";
			cout << "┃□■□□□□□□■□□□□■□■□□□┃┃-. 저장  후 ┃\n";
			cout << "┃□□■□■■■□■□□■■■□■■■□┃┃   게임종료 ┃\n";
			cout << "┃□□■□■□■□■□□□■■■■■□□┃┃            ┃\n";
			cout << "┃□□□■□□□■□□□□□□■□□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□■■■□□□┃┃            ┃\n";
			cout << "┃□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
			cout << "┗━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
			Sleep(700);
			gotoxy(1, 1);
		}
		health = 9;
		hungry += 3;
		toilet += 2;
		funny -= 2;
	}
	else
	{
		gotoxy(13, 13);
		cout << "┏━━━━━━━━━━┓";
		gotoxy(13, 14);
		cout << "┃아픈 곳이 없습니다..┃";
		gotoxy(13, 15);
		cout << "┗━━━━━━━━━━┛";
		Sleep(1000);
		system("cls");

	}
}
// 병원 
void guineapigPrint::eat()
{
	srand(time_t(NULL)); //srand함수
	if (health>0){
		if (hungry <= 0){
			gotoxy(13, 13);
			cout << "┏━━━━━━━━━━┓";
			gotoxy(13, 14);
			cout << "┃배고프지가 않습니다.┃";
			gotoxy(13, 15);
			cout << "┗━━━━━━━━━━┛";
			Sleep(1000);
			system("cls");
		}
		else{
			for (int i = 0; i<4; i++){
				gotoxy(3, 2);
				cout << "□□□□□□□□□□□□□□□□□□\n";
				gotoxy(3, 3);
				cout << "□□□□□□□□□□□□□□□□□□\n";
				gotoxy(3, 4);
				cout << "□□□□□□□□□□□□□□□□□□\n";
				gotoxy(3, 5);
				cout << "□□■■■■■□□□□□□□□□□□\n";
				gotoxy(3, 6);
				cout << "□■□□□□□■□□□□□□□□□□\n";
				gotoxy(3, 7);
				cout << "■□□□□■■□■□□□□□□□□□\n";
				gotoxy(3, 8);
				cout << "■□□□□□□□■□□□□□□□□□\n";
				gotoxy(3, 9);
				cout << "■□□□□□□□■□□□□■■■■□\n";
				gotoxy(3, 10);
				cout << "■□□□□■■■■□□□■■□■□■\n";
				gotoxy(3, 11);
				cout << "■□□□□□□□■□□□■□■□■■\n";
				gotoxy(3, 12);
				cout << "□■□■■□□□■□□□■■■■■■\n";
				gotoxy(3, 13);
				cout << "□■□■□■□■□□□□■□□□□■\n";
				gotoxy(3, 14);
				cout << "□□■□□□■□□□□□□■■■■□\n";
				gotoxy(3, 15);
				cout << "□□□□□□□□□□□□□□□□□□\n";
				gotoxy(3, 16);
				cout << "□□□□□□□□□□□□□□□□□□\n";
				Sleep(400);
				gotoxy(3, 2);
				cout << "□□□■■■■■■□□□□□□□□□\n";
				gotoxy(3, 3);
				cout << "□□■□□□□□□■□□□□□□□□\n";
				gotoxy(3, 4);
				cout << "□■□□□■■■□■□□□□□□□□\n";
				gotoxy(3, 5);
				cout << "□■□□□□□□□■□□□□□□□□\n";
				gotoxy(3, 6);
				cout << "■□□□□■■■■■■□□□□□□□\n";
				gotoxy(3, 7);
				cout << "■□□□□■□□□□□□□□□□□□\n";
				gotoxy(3, 8);
				cout << "■□□□□■□■□■□□□□□□□□\n";
				gotoxy(3, 9);
				cout << "■□■□□■□■□■□□□□□□□□\n";
				gotoxy(3, 10);
				cout << "■■■□□■■■■■■□■□□■□□\n";
				gotoxy(3, 11);
				cout << "■□□□□□□□□■□□■□□■□■\n";
				gotoxy(3, 12);
				cout << "□■□■■■□■■□□□■■■■■■\n";
				gotoxy(3, 13);
				cout << "□■□■□■□■□□□□■□□□□■\n";
				gotoxy(3, 14);
				cout << "□□■□□□■□□□□□□■■■■□\n";
				Sleep(400);
				gotoxy(3, 2);
			}
			system("cls");
			cout << "\n 밥을 먹어요 우걱우걱 우걱 우걱\n\n 허기가 해소되었습니다.\n\n ";
			hungry -= 3;
			sleep += 1;
			funny += rand() % 2;
			health += 1;
			toilet += 1;
			toilet += rand() % 3; // 다마고치 상태치 초기화 (0~9범위 설정)


			system("pause");
		}
	}
	else{
		gotoxy(13, 13);
		cout << "┏━━━━━━━━━━━┓";
		gotoxy(13, 14);
		cout << "┃다마고치가병에걸렸어요┃";
		gotoxy(13, 15);
		cout << "┗━━━━━━━━━━━┛";
		Sleep(1000);
	}
}
void guineapigPrint::status()
{
	//다마고치정보출력 
	gotoxy(3, 2);
	cout << "━━━━━━━━━━━━━━━━━━━";
	gotoxy(3, 3);
	cout << "         내 다마고치의 상태           ";
	gotoxy(3, 4);
	cout << "━━━━━━━━━━━━━━━━━━━";
	gotoxy(3, 5);
	cout << "이름                                  ";
	gotoxy(15, 5);
	cout << name << endl;
	gotoxy(3, 6);
	cout << "나이                                  ";
	gotoxy(15, 6);
	cout << age << endl;
	gotoxy(3, 7);
	cout << "성별                                  ";
	gotoxy(15, 7);
	cout << sex << endl;
	gotoxy(3, 8);
	cout << "혈액형                                ";
	gotoxy(15, 8);
	cout << bltype << endl;
	gotoxy(3, 9);
	cout << "건강도                                ";
	gotoxy(15, 9);
	cout << health << endl;
	gotoxy(3, 10);
	cout << "용변                                  ";
	gotoxy(15, 10);
	cout << toilet << endl;
	gotoxy(3, 11);
	cout << "허기                                  ";
	gotoxy(15, 11);
	cout << hungry << endl;
	gotoxy(3, 12);
	cout << "수면                                  ";
	gotoxy(15, 12);
	cout << sleep << endl;
	gotoxy(3, 13);
	cout << "행복                                  ";
	gotoxy(15, 13);
	cout << funny << endl;
	gotoxy(3, 14);
	cout << "지능                                  ";
	gotoxy(15, 14);
	cout << intel << endl;
	gotoxy(3, 15);
	cout << "상태                                  ";
	gotoxy(15, 15);
	cout << stat;
	gotoxy(3, 16);
	system("pause");
}

void guineapigPrint::death()
{
	gotoxy(1, 1);
	cout << "┏━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□┃┃  -=MENU=-  ┃\n";
	cout << "┃□□□□■□□□□□□□□■□□□□□┃┃            ┃\n";
	cout << "┃□□□□□■□□■■□□■□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□■■□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□■■■■■■■■■■□□□□□┃┃1. 상태확인 ┃\n";
	cout << "┃□□□□■■■■■■■■■■□□□□□┃┃2. 식사     ┃\n";
	cout << "┃□□□□□□□□■■□□□□□□□□□┃┃3. 화장실   ┃\n";
	cout << "┃□□□□□□□□■■□□□□□□□□□┃┃4. 취침     ┃\n";
	cout << "┃□□□□□□□□■■□□□□□□□□□┃┃5. 병원     ┃\n";
	cout << "┃□□□□□□□□■■□□□□□□□□□┃┃6. 놀아주기 ┃\n";
	cout << "┃□□□□□□□□■■□□□□□□□□□┃┃-. 저장  후 ┃\n";
	cout << "┃□□□□□□□□■■□□□□□□□□□┃┃   게임종료 ┃\n";
	cout << "┃□□□□□□■■■■■■□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□■■■■■■■■□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□■■■■■■■■□□□□□□┃┃            ┃\n";
	cout << "┗━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
	Sleep(2000);
	gotoxy(5, 11);
	cout << "┏━━━━━━━━━━━━━━┓";
	gotoxy(5, 12);
	cout << "┃다마고치가 죽었습니다.......┃";
	gotoxy(5, 13);
	cout << "┗━━━━━━━━━━━━━━┛\n\n\n\n";
	Sleep(2000);
	exit(0);
}

void guineapigPrint::enjoy() // 놀아주기 함수
{
	srand(time_t(NULL));
	system("cls");
	int sel;
	int key, point[2] = { 0, 0 }; // point[0]:패 point[1]:승
	string key2;
	cout << "놀이 방법 1. 가위바위보 2. 사랑주기 3. 책읽어주기\n☞ ";

	cin >> sel;

	if (sel == 1)//가위바위보 
	{
		for (int i = 0; i<5; i++){
			system("cls");
			cout << " (1)가위, (2)바위, (3)보를 정하세요! \n(그만하려면 '4'를 입력)\n☞ ";
			cin >> key2;
			key = rand() % 3;
			if (key2 == "1")
			{

				if (key == 0)
				{
					cout << " 비겼습니다!!\n";
					Sleep(200);
				}
				if (key == 1)
				{
					cout << "졌습니다..\n";
					Sleep(200);
					point[0] += 1;
				}
				if (key == 2)
				{
					cout << "이겼습니다.\n";
					Sleep(200);
					point[1] += 1;
				}
			}
			else if (key2 == "2")
			{
				if (key == 1)
				{
					cout << " 비겼습니다!! \n";
					Sleep(200);
				}
				if (key == 2)
				{
					cout << "졌습니다..\n";
					Sleep(200);
					point[0] += 1;
				}
				if (key == 0)
				{
					cout << "이겼습니다.\n";
					Sleep(200);
					point[1] += 1;
				}
			}
			else if (key2 == "3")
			{
				if (key == 2)
				{
					cout << " 비겼습니다!! \n";
					Sleep(200);
				}
				if (key == 0)
				{
					cout << "졌습니다..\n";
					Sleep(200);
					point[0] += 1;
				}
				if (key == 1)
				{
					cout << "이겼습니다.\n";
					Sleep(200);
					point[1] += 1;
				}
			}
			else if (key2>"4" || key2<"1")
			{
				cout << "잘못된 입력입니다!";
			}
			else if (key2 == "4") // 끝
			{
				cout << "그만하겠습니다!\n";
				break;
			}
		}
		cout << "다마고치에게 이긴 횟수 : " << point[1] << endl;
		cout << "다마고치에게 진 횟수 : " << point[0] << endl;
		cout << name << "(이)가 많이 이길수록 행복지수가 많이 상승합니다." << endl;
		if (point[1]>point[0]) { point[0] = 0; point[1] = 0; }
		cout << (point[0] - point[1]) << "의 행복지수가 상승했습니다." << endl;
		funny += (point[0] - point[1]);
		health -= 2;
		toilet += 1;
		hungry += 1;
		sleep += 1;
		system("pause");

	}

	if (sel == 2)
	{
		gotoxy(5, 10);
		cout << "━━━━━━━━━━━━━━━━━━━━━━━━";
		gotoxy(5, 11);
		cout << name << "!! 무럭무럭 크거라!~ 사랑한다~ ♡" << endl;
		gotoxy(5, 12);
		cout << "━━━━━━━━━━━━━━━━━━━━━━━━";
		Sleep(1000);
		funny += 1;
		health -= 1;
		sleep += 2;
		toilet += 1;
		hungry += 2;

	}
	if (sel == 3)
	{
		int j = rand() % 4;
		switch (j){
		case 0:
			cout << "님은 갔습니다. 아아, 사랑하는 나의 님은 갔습니다.\n푸른 산빛을 깨치고 단풍나무 숲을 향하여 난 작은 길을 걸어서, 차마 떨치고 갔습니다.\n황금의 꽃같이 굳고 빛나던 옛 맹서는 차디찬 티끌이 되어서 한숨의 미풍에 날아갔습니다.\n날카로운 첫 키스의 추억은 나의 운명의 지침을 돌려놓고, 뒷걸음 쳐서 사라졌습니다.\n나는 향기로운 님의 말소리에 귀먹고, 꽃다운 님의 얼굴에 눈멀었습니다.\n\n- 한용운, 님의 침묵 中\n\n";
			system("pause");
			break;
		case 1:
			cout << "모란이 피기까지는, 나는 아직 나의 봄을 기다리고 있을 테요.\n모란이 뚝뚝 떨어져 버린 날, 나는 비로소 봄을 여읜 설움에 잠길 테요. \n오월 어느 날, 그 하루 무덥던 날,떨어져 누운 꽃잎마저 시들어 버리고는\n천지에 모란은 자취도 없어지고,뻗쳐 오르던 내 보람 서운케 무녀졌느니,모란이 지고 말면 그뿐, 내 한 해는 다 가고 말아, 삼백 예순 날 섭섭해 우옵내다.\n모란이 피기까지는, 나는 아직 기다리고 있을 테요, 찬란한 슬픔의 봄을.\n\n- 김영랑, 모란이 피기까지는\n\n";
			system("pause");
			break;
		case 2:
			cout << "죽는 날까지 하늘을 우러러 한 점 부끄럼이 없기를 잎새에 이는 바람에도 나는 괴로워했다.\n별을 노래하는 마음으로 모든 죽어가는 것을 사랑해야지.\n그리고 나한테 주어진 길을 걸어가야겠다.\n\n오늘 밤에도 별이 바람에 스치운다.\n- 윤동주, 서시\n\n";
			system("pause");
			break;
		case 3:
			cout << "나 보기가 역겨워 가실 때에는 말없이 고이 보내 드리오리다.\n영변에 약산 진달래꽃 아름 따다 가실 길에 뿌리오리다.\n가시는 걸음 걸음 놓인 그 꽃을 사뿐히 즈려 밟고 가시옵소서\n\n- 김소월, 진달래 꽃\n\n";
			system("pause");
			break;
		}
		gotoxy(5, 10);
		cout << "━━━━━━━━━━━━━━━━━━━━━━━━";
		gotoxy(5, 11);
		cout << "    지능지수와 함께 행복도가 상승하였습니다!";
		gotoxy(5, 12);
		cout << "━━━━━━━━━━━━━━━━━━━━━━━━";
		Sleep(1500);
		funny += 1;
		health -= 2;
		intel += 1;
		sleep += 2;
		hungry += 1;
	}





}

void guineapigPrint::levelup(){
	gotoxy(1, 1);
	cout << "┏━━━━━━━━━━━━━━━━━━━━━━━━┓┏━━━━━━┓\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃  -=MENU=-  ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□level up□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃1. 상태확인 ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃2. 식사     ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃3. 화장실   ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃4. 취침     ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃5. 병원     ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃6. 놀아주기 ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃9. 레벨업   ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃-. 저장  후 ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃   게임종료 ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┃□□□□□□□□□□□□□□□□□□□□□□□□┃┃            ┃\n";
	cout << "┗━━━━━━━━━━━━━━━━━━━━━━━━┛┗━━━━━━┛\n";
	Sleep(2000);

	funny += 9; //funny가 9가 되면 레벨업.. 이 값 조절 해야 할 듯 

	system("pause");
}
